import React from "react"
import "./Home.css"

class Home extends React.Component{
    render(){
        return (
        <div className="box-about">
            <p> Καλωσήλθατε στην εφαρμογή αναζήτησης διαδρομών του ΟΑΣΘ που αναπτύχθηκε στα πλαίσια του μαθήματος Διαδύκτυο και Εφαρμογές 2020.

            </p> 
            <p>Η εφαρμογή δίνει τη δυνατότητα αναζήτησης διαδρομών που ξεκινούν από μια στάση που επιλέγετε, και εμφάνιση τους σε χάρτη.
            </p> 
            <p>Από την καρτέλα "ΑΝΑΖΗΤΗΣΗ (ΟΛΕΣ ΟΙ ΣΤΑΣΕΙΣ)", μπορείτε να δείτε όλες τις διαθέσιμες στάσεις. Επιλέγοντας μία από αυτές, εμφανίζονται οι διαδρομές που ξεκινούν από τη στάση αυτή. Επιλέγοντας τελικά μία από αυτές τις διαδρομές, εμφανίζεται στο χάρτη η διαδρομή αυτή.
            </p>
            <p> Εναλλακτικά, από την καρτέλα "ΑΝΑΖΗΤΗΣΗ (ΤΟΠΟΘΕΣΙΑ)", δίνεται η δυνατότητα επιλογής της τοποθεσίας στο χάρτη, ώστε να εμφανιστούν μόνο οι 10 κοντινότερες στάσεις στην τοποθεσία αυτή.</p>
            <p>
             Όλες οι τοποθεσίες είναι προσβάσιμες από URL, ώστε να μπορούν να μοιραστούν με άλλους χρήστες.
            </p>
            <p>
              Η εφαρμογή αναπτύχθηκε με React.js και έγινε χρήση διάφορων modules, τα πιο σημαντικά το Bootstrap για αρκετά stylings, το React-Leaflet για τον χάρτη, το geolib για πράξη με τις συντεταφμένες και το React-Router για το routing. Πληροφορίες λαμβάνονται από το API http://feed.opendata.imet.gr:23577/itravel/.
            </p>
            
        </div>
        )
    }
}

export default Home;